---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TagOnPlacementUi
source: html/804bc92a-bb8f-7bb7-ffa6-c63375458fe2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TagOnPlacementUi Property

"Tag on Placement"

## Syntax (C#)
```csharp
public static ForgeTypeId TagOnPlacementUi { get; }
```